let class1 = ['강지민', '곽서영', '권우진', '김규대', '김보민', '김영서', '김지원', '박서윤', '박채윤', '백승주', '서재훈', '손영석', '송현석', '신원석', '안도영', '안지혁', '여수아', '유대균', '유선빈', '이서영', '이승현', '전유현', '전혜린', '정미진', '정윤지', '추주안', '한지연', '허진구', '홍승우', '황윤하', '황호신'];
let class2 = ['김건우', '김민서', '김선유', '김아현', '김연우', '김영서', '김이안', '김재현', '김정민', '마준하', '박문찬', '박성익', '서예은', '안혜주', '오은수', '윤슬', '윤지성', '이강호', '이나경', '이준호', '임지유', '정서윤', '정재율', '정지우', '정채이', '조수현', '조영래', '조한수', '하윤지'];
let class3 = ['김서윤', '김소은', '김수겸', '김유안', '김정훈', '김준혁', '김지아', '김지후', '김진모', '김태준', '김하연', '남채은', '박건주', '박예준', '박주하', '반예현', '양예린', '원다인', '윤혜준', '이세담', '이수아', '이은수', '이재윤', '임하윤', '장하진', '장현서', '전민규', '정민수', '조은우', '한진호', '황세연'];
let class4 = ['곽윤아', '김규리', '김규린', '김재성', '김종현', '김태연', '김하율', '김휘영', '남궁윤', '노제현', '류혁인', '박가온', '박서윤', '박송현', '박수빈', '신지원', '윤채은', '이윤서', '이준서', '이준희', '이지훈', '이현승', '이효은', '임규리', '임동하', '임지석', '조영', '최명재', '최유주', '한가연', '한서희'];
let class5 = ['구하정', '김가빈', '김소윤', '김연아', '김준하', '김지율', '김지효', '김진철', '김현서', '나현준', '류태영', '문유섬', '박규태', '박윤성', '신혜연', '양효정', '유승희', '은다온', '이제준', '이제찬', '이주연', '이준성', '이지훈', '이희성', '임상혁', '임주안', '전지후', '정민수', '정소율', '정현서', '최선아'];
let class6 = ['권승준', '김나윤', '김로제', '김서윤', '김영민', '김유주', '김은우', '김재율', '김종현', '마시우', '박도연', '박시윤', '박우원', '박주형', '박준수', '오하윤', '윤시현', '이다현', '이라연', '이상원', '이세령', '이수아', '이재국', '이하은', '전지우', '정재균', '조민찬', '조윤호', '조현준', '조호연', '한시온'];
let class7 = ['강민서', '김규원', '김명준', '김승호', '김시현', '김정윤', '김지수', '김채현', '김현진', '박시하', '박윤호', '박주형', '박지용', '박현서', '오나경', '이서준', '이서진', '이서현', '이승준', '이은찬', '장서연', '정윤성', '조장현', '차율', '천예빈', '최서희', '최재영', '홍서하', '홍승연', '홍지윤', '황서윤'];
let class8 = ['김가빈', '김도윤', '김리원', '김보민', '김성윤', '김정빈', '김진영', '김하은', '박준서', '박준우', '서지성', '신서진', '심재윤', '양건우', '양은채', '엄소정', '유상욱', '유시연', '유혜림', '이승규', '이지우', '임재아', '전재인', '정연수', '차호단', '최승현', '최시원', '최준영', '최한결'];
let class9 = ['권동환', '권민서', '김근호', '김동건', '김성준', '김예지', '김지윤', '김하은', '박세은', '박준영', '박지안', '박진우', '박희정', '배기민', '백인성', '성지우', '양세미', '유영재', '윤서영', '윤영현', '윤지훈', '임동현', '정예진', '정혜린', '조연경', '진예성', '최병준', '최유정', '최지성', '하유림', '홍재욱'];
let class10 = ['강기범', '강준혁', '고재성', '고종욱', '김대환', '김서진', '김선민', '김시현', '나주희', '남지원', '박서윤', '박성은', '박지유', '박진표', '배주영', '서윤준', '서주원', '서주하', '손지호', '신승우', '안지성', '유강훈', '윤서연', '이제인', '임현준', '정지민', '조은서', '진효정', '최연우', '한무진', '현재민'];
let class11 = ['강예현', '곽서연', '김동진', '김민석', '김성찬', '김시은', '김채영', '김태인', '박송연', '박수언', '박재현', '박찬영', '신세영', '신재영', '심승현', '유성빈', '유재빈', '윤재석', '윤채은', '윤현승', '이소율', '이지윤', '이해림', '장여진', '정서후', '최병민', '최은성', '최준호', '토이선우', '홍영서', '홍희주'];
let class12 = ['강구현', '강한성', '공유나', '곽승윤', '권우혁', '박규연', '박서은', '박찬하', '배세준', '백율', '백하리', '변지환', '서이준', '송민준', '신승현', '안수현', '유재홍', '윤지유', '이민서', '이수빈', '이하정', '장제인', '정단', '정은지', '조용우', '최현서', '한아인', '홍민준', '황민철', '황준희'];
let teacher_names = ['', '정유진(미술)', '이명주(국어)', '김나령(한문)', '황은주(음악)', '권현경', '근은경(역사)', '안영남(수학)', '이승희(도덕)', '???(???)', '정소현(체육)', '원유선(수학)', '김미리(국어)']

function print_class(name) {
    if (class1.indexOf(name) !== -1) {
        return 1;
    } else if (class2.indexOf(name) !== -1) {
        return 2;
    } else if (class3.indexOf(name) !== -1) {
        return 3;
    } else if (class4.indexOf(name) !== -1) {
        return 4;
    } else if (class5.indexOf(name) !== -1) {
        return 5;
    } else if (class6.indexOf(name) !== -1) {
        return 6;
    } else if (class7.indexOf(name) !== -1) {
        return 7;
    } else if (class8.indexOf(name) !== -1) {
        return 8;
    } else if (class9.indexOf(name) !== -1) {
        return 9;
    } else if (class10.indexOf(name) !== -1) {
        return 10;
    } else if (class11.indexOf(name) !== -1) {
        return 11;
    } else if (class12.indexOf(name) !== -1) {
        return 12;
    } else {
        return 0;
    }
}

function findClass() {
    let name = document.getElementById("nameInput").value;
    let class_name = print_class(name);

    if (class_name == 0) {
        document.getElementById("resultDiv").innerHTML = "죄송합니다, " + name + " 은(는) 프로그램이 찾을 수 없습니다.";
    }
    else {
        document.getElementById("resultDiv").innerHTML = name + " 은(는)" + class_name + "반 입니다.\n" + class_name + "반 선생님은 " + teacher_names[class_name] + "입니다.";
    }
}